#                                     INTRODUCTION TO PANDAS

Pandas is a popular open-source software library written for the Python programming language, primarily used for data manipulation and analysis. It provides powerful and flexible data structures, most notably the DataFrame, which allows for efficient handling of tabular data.

In [2]:
# Import the libaray of numpy and pandas in the juypter notebook 
import numpy as np
import pandas as pd

## CREATING PANDAS SERIES

Through the List

In [3]:
# create the list and element in list
list=[1,2,3,4]
# now make the list into pandas series by the Series function
pd1=pd.Series(list)
print(pd1)

0    1
1    2
2    3
3    4
dtype: int64

Through the Array

In [4]:
# create the array using numpy 
arr=np.array([1,2,3,4,5])
# now make the array into pandas series by the Series function
pd2=pd.Series(arr)
print(pd1)

0    1
1    2
2    3
3    4
dtype: int64

Index in Series

In [5]:
# Series index in the Series
pd3=pd.Series(data=list,index=['Columuns1','Columuns2','Columuns3','Columuns4'])
print(pd3)

Columuns1    1
Columuns2    2
Columuns3    3
Columuns4    4
dtype: int64

Through the Dictionary

In [6]:
# creating the dictionary
step={'day1':6000,'day2':6600,'day3':6660,'day4':6666}
# now create the convert the dictionary to pandas Series using Series function 
pd4=pd.Series(step)
print(pd4)

day1    6000
day2    6600
day3    6660
day4    6666
dtype: int64

Pandas Series---->List

In [7]:
pd1.to_list()

[1, 2, 3, 4]

## Aggergate function on the Pandas Series

In [8]:
# this aggergate function which tells the min max sum and other aggergate value
pd1.agg([min,max,sum])

/var/folders/kj/_lj1sx516z96c6cwhh2yrby00000gn/T/ipykernel_2783/3689536320.py:2: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  pd1.agg([min,max,sum])
/var/folders/kj/_lj1sx516z96c6cwhh2yrby00000gn/T/ipykernel_2783/3689536320.py:2: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  pd1.agg([min,max,sum])
/var/folders/kj/_lj1sx516z96c6cwhh2yrby00000gn/T/ipykernel_2783/3689536320.py:2: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd1.agg([min,max,sum])

min     1
max     4
sum    10
dtype: int64

# PANDAS DATAFRAME

Two-dimensional, size-mutable, potentially heterogeneous tabular data. Data structure also contains labeled axes (rows and columns).

Through the list

In [9]:
# Converting the list(one dimesnal) into dataframe(2-D Table) using Dataframe
pd.DataFrame(list)

   0
0  1
1  2
2  3
3  4

Through the Dictionary

In [10]:
# creating the Dictionary
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
# convert the dictionary to dataframe
df=pd.DataFrame(data)
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

Add the Columuns

In [11]:
df['Age after 5']=df['Age'] + 5

In [12]:
df

    Name  Age  Age after 5
0    Tom   20           25
1   nick   21           26
2  krish   19           24
3   jack   18           23

Delete the Columuns

In [13]:
del df['Age after 5']

In [14]:
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

Mathmatical and Satistical Function

In [15]:
# it will tells the sum of the columun
df['Age'].sum()

np.int64(78)

In [16]:
# it will tells the sum of the  columun
df['Age'].mean()

np.float64(19.5)

In [17]:
# it will tell the min
df['Age'].min()

18

In [18]:
# it will tell max
df['Age'].max()

21

In [19]:
# it will tell varaince
df['Age'].var()

1.6666666666666667

In [20]:
# it will tell standrad deviation
df['Age'].std()

1.2909944487358056

In [21]:
# it will describe the mathematical and statisctal data of the dataset
df['Age'].describe()

count     4.000000
mean     19.500000
std       1.290994
min      18.000000
25%      18.750000
50%      19.500000
75%      20.250000
max      21.000000
Name: Age, dtype: float64

## Workin with dataset

In [22]:
# import the dataset in the python notebook
df=pd.read_csv("Football.csv")

In [23]:
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [25]:
df.describe()

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
25%,14.000000,0.000000,1363.500000,8.000000,6.100000,0.340000,37.750000,17.000000,2.335000,0.980000,2017.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
75%,31.000000,5.000000,2822.000000,14.000000,13.252500,0.570000,86.000000,37.000000,3.382500,1.540000,2019.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000